app/controllers/tickets_controller.rb

  def list
  	@tickets = Ticket.all
---
SELECT "tickets".* FROM "tickets"

  def search
  	@count = 0
  	if params["search_date_time"]
  		@count = Ticket.select{|ticket| params["search_date_time"].to_datetime.change(:offset =>Time.now.strftime("%:z")).between?(ticket.in_time, ticket.out_time || Time.now)}.count
---
SELECT "tickets".* FROM "tickets" ORDER BY "tickets"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "tickets"

  def import
  	begin
  	  tickets_count, errors = Ticket.import(params[:file])
  	  if errors.empty?
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."ticket_id" IS NULL LIMIT 1
SELECT 1 AS one FROM "tickets" WHERE ("tickets"."ticket_id" = '1' AND "tickets"."id" != 1) LIMIT 1